STM32World/stlink/src/stlink-lib/flash_loader.c
/*
 * File: flash_loader.c
 *
 * Flash loaders
 */

#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include <unistd.h>

#include <stm32.h>
#include <stm32_register.h>
#include <stlink.h>

#include "flash_loader.h"
#include "common_flash.h"
#include "helper.h"
#include "logging.h"
#include "read_write.h"

#define FLASH_REGS_BANK2_OFS      0x40
#define FLASH_BANK2_START_ADDR    0x08080000

#define STM32F0_WDG_KR            0x40003000
#define STM32H5_WDG_KR            0x40003000
#define STM32H7_WDG_KR            0x58004800

#define STM32F0_WDG_KR_KEY_RELOAD 0xAAAA

/*
 * !!! DO NOT MODIFY FLASH LOADERS DIRECTLY !!!
 *
 * Edit assembly files in the '/flashloaders' instead. The sizes of binary
 * flash loaders must be aligned by 4 (it's written by stlink_write_mem32)
 */

// flashloaders/stm32f0.s -- compiled with thumb2
static const uint8_t loader_code_stm32vl[] = {
    0x00, 0xbf, 0x00, 0xbf,
    0x09, 0x4f, 0x1f, 0x44,
    0x09, 0x4d, 0x3d, 0x44,
    0x04, 0x88, 0x0c, 0x80,
    0x02, 0x30, 0x02, 0x31,
    0x4f, 0xf0, 0x01, 0x07,
    0x2c, 0x68, 0x3c, 0x42,
    0xfc, 0xd1, 0x4f, 0xf0,
    0x14, 0x07, 0x3c, 0x42,
    0x01, 0xd1, 0x02, 0x3a,
    0xf0, 0xdc, 0x00, 0xbe,
    0x00, 0x20, 0x02, 0x40,
    0x0c, 0x00, 0x00, 0x00
};

// flashloaders/stm32f0.s -- thumb1 only, same sequence as for STM32VL, bank ignored
static const uint8_t loader_code_stm32f0[] = {
    0xc0, 0x46, 0xc0, 0x46,
    0x08, 0x4f, 0x1f, 0x44,
    0x08, 0x4d, 0x3d, 0x44,
    0x04, 0x88, 0x0c, 0x80,
    0x02, 0x30, 0x02, 0x31,
    0x06, 0x4f, 0x2c, 0x68,
    0x3c, 0x42, 0xfc, 0xd1,
    0x05, 0x4f, 0x3c, 0x42,
    0x01, 0xd1, 0x02, 0x3a,
    0xf2, 0xdc, 0x00, 0xbe,
    0x00, 0x20, 0x02, 0x40,
    0x0c, 0x00, 0x00, 0x00,
    0x01, 0x00, 0x00, 0x00,
    0x14, 0x00, 0x00, 0x00
};

// flashloaders/stm32wb0.s
static const uint8_t loader_code_stm32wb0[] = {
    0x0b, 0x4b, 0xc9, 0x1a,
    0x89, 0x08, 0x09, 0x4f,
    0xb9, 0x61, 0x40, 0x37,
    0x78, 0xc8, 0x78, 0xc7,
    0x50, 0x3f, 0x0d, 0x25,
    0x3d, 0x61, 0xcc, 0x24,
    0x3c, 0x60, 0x3c, 0x69,
    0x2c, 0x40, 0xfc, 0xd0,
    0x64, 0x08, 0x02, 0xd1,
    0x04, 0x31, 0x10, 0x3a,
    0xee, 0xdc, 0x00, 0xbe,
    0x00, 0x10, 0x00, 0x40,
    0x00, 0x00, 0x04, 0x10
};

// flashloaders/stm32lx.s -- compiled for armv6-m for compatibility with both
// armv6-m cores (STM32L0) and armv7-m cores (STM32L1)
static const uint8_t loader_code_stm32lx[] = {
    0x04, 0x68, 0x0c, 0x60,
    0x04, 0x30, 0x04, 0x31,
    0x04, 0x3a, 0xf9, 0xdc,
    0x00, 0xbe, 0x00, 0x00
};

// flashloaders/stm32f4.s
static const uint8_t loader_code_stm32f4[] = {
    0xdf, 0xf8, 0x24, 0xc0,
    0xdf, 0xf8, 0x24, 0xa0,
    0xe2, 0x44, 0x04, 0x68,
    0x0c, 0x60, 0x00, 0xf1,
    0x04, 0x00, 0x01, 0xf1,
    0x04, 0x01, 0xba, 0xf8,
    0x00, 0x40, 0x14, 0xf0,
    0x01, 0x0f, 0xfa, 0xd1,
    0x04, 0x3a, 0xf2, 0xdc,
    0x00, 0xbe, 0x00, 0xbf,
    0x00, 0x3c, 0x02, 0x40,
    0x0e, 0x00, 0x00, 0x00
};

// flashloaders/stm32f4lv.s
static const uint8_t loader_code_stm32f4_lv[] = {
    0xdf, 0xf8, 0x24, 0xc0,
    0xdf, 0xf8, 0x24, 0xa0,
    0xe2, 0x44, 0x04, 0x78,
    0x0c, 0x70, 0x00, 0xf1,
    0x01, 0x00, 0x01, 0xf1,
    0x01, 0x01, 0xba, 0xf8,
    0x00, 0x40, 0x14, 0xf0,
    0x01, 0x0f, 0xfa, 0xd1,
    0x01, 0x3a, 0xf2, 0xdc,
    0x00, 0xbe, 0x00, 0xbf,
    0x00, 0x3c, 0x02, 0x40,
    0x0e, 0x00, 0x00, 0x00
};

// flashloaders/stm32l4.s
static const uint8_t loader_code_stm32l4[] = {
    0xdf, 0xf8, 0x28, 0xc0,
    0xdf, 0xf8, 0x28, 0xa0,
    0xe2, 0x44, 0x05, 0x68,
    0x44, 0x68, 0x0d, 0x60,
    0x4c, 0x60, 0x00, 0xf1,
    0x08, 0x00, 0x01, 0xf1,
    0x08, 0x01, 0xda, 0xf8,
    0x00, 0x40, 0x14, 0xf4,
    0x80, 0x3f, 0xfa, 0xd1,
    0x08, 0x3a, 0xf0, 0xdc,
    0x00, 0xbe, 0x00, 0xbf,
    0x00, 0x20, 0x02, 0x40,
    0x10, 0x00, 0x00, 0x00
};

// flashloaders/stm32h5.s  (compiled with -mcpu=Cortex-M33)
// The loader handles sub-16-byte tail chunks on-device via a stack buffer,
// so the host stages the exact payload (padded_size = size) without rounding.
static const uint8_t loader_code_stm32h5[] = {
    0x00, 0x2b, 0x06, 0xd0,
    0xdf, 0xf8, 0xb8, 0xc0,
    0xdf, 0xf8, 0xb8, 0xb0,
    0xdf, 0xf8, 0xb8, 0xa0,
    0x05, 0xe0, 0xdf, 0xf8,
    0xa0, 0xc0, 0xdf, 0xf8,
    0xa0, 0xb0, 0xdf, 0xf8,
    0xa0, 0xa0, 0xef, 0xf3,
    0x10, 0x83, 0x72, 0xb6,
    0x84, 0xb0, 0xdf, 0xf8,
    0xa4, 0x90, 0xdf, 0xf8,
    0xa4, 0x80, 0xca, 0xf8,
    0x00, 0x90, 0xdc, 0xf8,
    0x00, 0x40, 0x14, 0xf0,
    0x0b, 0x0f, 0xfa, 0xd1,
    0xdb, 0xf8, 0x00, 0x40,
    0x44, 0xf0, 0x02, 0x04,
    0xcb, 0xf8, 0x00, 0x40,
    0x00, 0x2a, 0x26, 0xdd,
    0x10, 0x2a, 0x01, 0xd3,
    0xf0, 0xc8, 0x11, 0xe0,
    0x6f, 0xf0, 0x00, 0x04,
    0x00, 0x94, 0x01, 0x94,
    0x02, 0x94, 0x03, 0x94,
    0x6d, 0x46, 0x16, 0x46,
    0x00, 0x2e, 0x05, 0xd0,
    0x10, 0xf8, 0x01, 0x4b,
    0x05, 0xf8, 0x01, 0x4b,
    0x01, 0x3e, 0xf7, 0xe7,
    0x9d, 0xe8, 0xf0, 0x00,
    0xf0, 0xc1, 0xbf, 0xf3,
    0x4f, 0x8f, 0xdc, 0xf8,
    0x00, 0x40, 0x14, 0xf0,
    0x0b, 0x0f, 0xfa, 0xd1,
    0x14, 0xea, 0x08, 0x0f,
    0x05, 0xd1, 0x10, 0x2a,
    0x01, 0xd3, 0x10, 0x3a,
    0xd8, 0xe7, 0x00, 0x22,
    0xd6, 0xe7, 0x20, 0x46,
    0xdb, 0xf8, 0x00, 0x40,
    0x24, 0xf0, 0x02, 0x04,
    0xcb, 0xf8, 0x00, 0x40,
    0xca, 0xf8, 0x00, 0x90,
    0x04, 0xb0, 0x83, 0xf3,
    0x10, 0x88, 0x00, 0xbe,
    0x20, 0x20, 0x02, 0x40,
    0x28, 0x20, 0x02, 0x40,
    0x30, 0x20, 0x02, 0x40,
    0x20, 0x20, 0x02, 0x50,
    0x28, 0x20, 0x02, 0x50,
    0x30, 0x20, 0x02, 0x50,
    0x00, 0x00, 0x9f, 0x00,
    0x00, 0x00, 0x9e, 0x00
};

// flashloaders/stm32f7.s
static const uint8_t loader_code_stm32f7[] = {
    0xdf, 0xf8, 0x28, 0xc0,
    0xdf, 0xf8, 0x28, 0xa0,
    0xe2, 0x44, 0x04, 0x68,
    0x0c, 0x60, 0x00, 0xf1,
    0x04, 0x00, 0x01, 0xf1,
    0x04, 0x01, 0xbf, 0xf3,
    0x4f, 0x8f, 0xba, 0xf8,
    0x00, 0x40, 0x14, 0xf0,
    0x01, 0x0f, 0xfa, 0xd1,
    0x04, 0x3a, 0xf0, 0xdc,
    0x00, 0xbe, 0x00, 0xbf,
    0x00, 0x3c, 0x02, 0x40,
    0x0e, 0x00, 0x00, 0x00
};

// flashloaders/stm32f7lv.s
static const uint8_t loader_code_stm32f7_lv[] = {
    0xdf, 0xf8, 0x28, 0xc0,
    0xdf, 0xf8, 0x28, 0xa0,
    0xe2, 0x44, 0x04, 0x78,
    0x0c, 0x70, 0x00, 0xf1,
    0x01, 0x00, 0x01, 0xf1,
    0x01, 0x01, 0xbf, 0xf3,
    0x4f, 0x8f, 0xba, 0xf8,
    0x00, 0x40, 0x14, 0xf0,
    0x01, 0x0f, 0xfa, 0xd1,
    0x01, 0x3a, 0xf0, 0xdc,
    0x00, 0xbe, 0x00, 0xbf,
    0x00, 0x3c, 0x02, 0x40,
    0x0e, 0x00, 0x00, 0x00
};


int32_t stlink_flash_loader_init(stlink_t *sl, flash_loader_t *fl) {
    uint32_t size = 0;
    uint32_t dfsr, cfsr, hfsr;

    /* Interrupt masking according to DDI0419C, Table C1-7 firstly force halt */
    stlink_write_debug32(sl, STM32_REG_DHCSR,
                           STM32_REG_DHCSR_DBGKEY | STM32_REG_DHCSR_C_DEBUGEN |
                           STM32_REG_DHCSR_C_HALT);
    /* and only then disable interrupts */
    stlink_write_debug32(sl, STM32_REG_DHCSR,
                           STM32_REG_DHCSR_DBGKEY | STM32_REG_DHCSR_C_DEBUGEN |
                           STM32_REG_DHCSR_C_HALT | STM32_REG_DHCSR_C_MASKINTS);

    // allocate the loader in SRAM
    if(stlink_flash_loader_write_to_sram(sl, &fl->loader_addr, &size) == -1) {
        WLOG("Failed to write flash loader to sram!\n");
        return (-1);
    }

    // allocate a one page buffer in SRAM right after loader
    fl->buf_addr = fl->loader_addr + size;
    if(sl->flash_type == STM32_FLASH_TYPE_H5) {
        /* Keep the H5 staging buffer in the first 64 KiB SRAM window. */
        fl->buf_addr = sl->sram_base + 0x1000;
        DLOG("H5 SRAM staging buffer at %#010x\n", fl->buf_addr);
    }
    ILOG("Successfully loaded flash loader in sram\n");

    // set address of IWDG key register for reset it
    if(sl->flash_type == STM32_FLASH_TYPE_H5) {
        fl->iwdg_kr = STM32H5_WDG_KR;
    } else if(sl->flash_type == STM32_FLASH_TYPE_H7) {
        fl->iwdg_kr = STM32H7_WDG_KR;
    } else {
        fl->iwdg_kr = STM32F0_WDG_KR;
    }

