STM32World/stlink/src/stlink-lib/flash_loader.c
    memcpy(sl->q_buf, loader_code, loader_size);
    int32_t ret = stlink_write_mem32(sl, sl->sram_base, (uint16_t) loader_size);

    if(ret) { return (ret); }

    *addr = sl->sram_base;
    *size = loader_size;

    return (0); // success
}

int32_t stlink_flash_loader_run(stlink_t *sl, flash_loader_t* fl, stm32_addr_t target, const uint8_t* buf, uint32_t size) {
    struct stlink_reg rr;
    uint32_t timeout;
    uint32_t loader_arg3 = 0;
    uint32_t flash_bank = BANK_1;
    uint32_t loader_pc = fl->loader_addr;
    uint32_t loader_lr = fl->loader_addr;
    uint32_t loader_sp = 0;
    uint32_t dhcsr, dfsr, cfsr, hfsr;
    uint16_t padded_size = size, pad_modulo = 1;
    if(sl->flash_type == STM32_FLASH_TYPE_WB0 ||
       sl->flash_type == STM32_FLASH_TYPE_H5) {
        pad_modulo = 16;
    }
    uint16_t unaligned_cnt = size % pad_modulo;
    if (unaligned_cnt) {
      padded_size = size + (pad_modulo - unaligned_cnt);
    }

    DLOG("Running flash loader, write address:%#x, size: %u, padded_size: %u\n", target, size, padded_size);
    if(sl->flash_type == STM32_FLASH_TYPE_H5) {
        flash_bank = stm32h5_flash_loader_bank(sl, target);
        loader_arg3 = flash_bank;
        loader_pc = fl->loader_addr | 1u;
        loader_lr = fl->loader_addr | 1u;
        loader_sp = (fl->buf_addr - 0x40u) & ~0x7u;
    }

    if(write_buffer_to_sram(sl, fl, buf, size, padded_size) == -1) {
        ELOG("write_buffer_to_sram() == -1\n");
        return (-1);
    }

    if(sl->flash_type == STM32_FLASH_TYPE_H5) {
        /*
         * The H5 SRAM loader owns the flash-controller state for each chunk.
         * Host-side code only stages data and launches the loader.
         */
        if(stlink_h5_uses_ap(sl)) {
            sl->h5_native_core_regs = true;
        }
        DLOG("H5 loader launch via AP%u bank %u (buf %#010x, loader %#010x)\n",
             sl->target_ap, flash_bank, fl->buf_addr, fl->loader_addr);
    }

    if((sl->flash_type == STM32_FLASH_TYPE_F1_XL) && (target >= FLASH_BANK2_START_ADDR)) {
        loader_arg3 = FLASH_REGS_BANK2_OFS;
    }

  /* Setup core */
  if(sl->flash_type == STM32_FLASH_TYPE_H5) {
      /*
       * Establish a valid execution frame first, then write the loader
       * arguments. Our H5 loader does not consume preserved register contents,
       * so avoid the extra r4-r13 clearing traffic on every chunk launch.
       * Reducing that register churn is more valuable here than clearing
       * scratch registers we do not actually depend on.
       */
      if(stlink_write_reg(sl, 0x01000000, 16) == -1 ||
         stlink_write_reg(sl, loader_pc, 15) == -1 ||
         stlink_write_reg(sl, loader_sp, 17) == -1 ||
         stlink_write_reg(sl, loader_lr, 14) == -1 ||
         stlink_write_reg(sl, 0, 18) == -1) {
          ELOG("Failed to prepare H5 loader execution frame\n");
          return (-1);
      }

      if(stlink_write_reg(sl, fl->buf_addr, 0) == -1 ||
         stlink_write_reg(sl, target, 1) == -1 ||
         stlink_write_reg(sl, padded_size, 2) == -1 ||
         stlink_write_reg(sl, loader_arg3, 3) == -1) {
          ELOG("Failed to prepare H5 flash loader register frame\n");
          return (-1);
      }
  } else if(stlink_write_reg(sl, fl->buf_addr, 0) == -1 ||   // source
            stlink_write_reg(sl, target, 1) == -1 ||         // target
            stlink_write_reg(sl, padded_size, 2) == -1 ||    // count
            stlink_write_reg(sl, loader_arg3, 3) == -1 ||    // bank selector or flash register offset
            stlink_write_reg(sl, fl->loader_addr, 15) == -1) { // pc register
      ELOG("Failed to prepare flash loader registers\n");
      return (-1);
  }

  /* Reset IWDG */
  if(fl->iwdg_kr) {
      stlink_write_debug32(sl, fl->iwdg_kr, STM32F0_WDG_KR_KEY_RELOAD);
  }

  /* Run loader */
  if(stlink_run(sl, RUN_FLASH_LOADER) == -1) {
      ELOG("Failed to start flash loader\n");
      return (-1);
  }

/*
 * This piece of code used to try to spin for .1 second by waiting doing 10000 rounds of 10 µs.
 * But because this usually runs on Unix-like OSes, the 10 µs get rounded up to the "tick"
 * (actually almost two ticks) of the system. 1 ms. Thus, the ten thousand attempts, when
 * "something goes wrong" that requires the error message "flash loader run error" would wait
 * for something like 20 seconds before coming up with the error.
 * By increasing the sleep-per-round to the same order-of-magnitude as the tick-rounding that
 * the OS uses, the wait until the error message is reduced to the same order of magnitude
 * as what was intended. -- REW.
 */

  // wait until done (reaches breakpoint)
  timeout = time_ms() + (sl->flash_type == STM32_FLASH_TYPE_H5 ? 2000 : 500);
  while (time_ms() < timeout) {
      usleep(10000);

      if(stlink_is_core_halted(sl)) {
          timeout = 0;
          break;
      }
  }

  if(timeout) {
      ELOG("Flash loader run error\n");
      goto error;
  }

  // check written byte count
  if(stlink_read_reg(sl, 2, &rr) == -1) {
      ELOG("Failed to read flash loader result register\n");
      goto error;
  }

  /*
  * The chunk size for loading is not rounded. The flash loader
  * subtracts the size of the written block (1-8 bytes) from
  * the remaining size each time. A negative value may mean that
  * several bytes garbage have been written due to the unaligned
  * firmware size.
  */
  if((sl->flash_type == STM32_FLASH_TYPE_H5 && rr.r[2] != 0) ||
     (sl->flash_type != STM32_FLASH_TYPE_H5 &&
      ((int32_t) rr.r[2] > 0 || (int32_t) rr.r[2] < -7))) {
      uint32_t error_addr = sl->flash_type == STM32_FLASH_TYPE_H5 ?
                                (target + size - rr.r[2]) :
                                (target + padded_size - rr.r[2]);
      ELOG("Flash loader write error at 0x%08X\n", error_addr);
      goto error;
  }

  return (0);

  error:
      dhcsr = dfsr = cfsr = hfsr = 0;
      stlink_force_debug(sl); // ensure we can read regs, even after timeout
      stlink_read_debug32(sl, STM32_REG_DHCSR, &dhcsr);
      stlink_read_debug32(sl, STM32_REG_DFSR, &dfsr);
      stlink_read_debug32(sl, STM32_REG_CFSR, &cfsr);
      stlink_read_debug32(sl, STM32_REG_HFSR, &hfsr);
      stlink_read_all_regs(sl, &rr);

      WLOG("Loader state: PC 0x%08X\n", rr.r[15]);
      WLOG("              R0 0x%08X R1 0x%08X\n", rr.r[0], rr.r[1]);
      WLOG("              R2 0x%08X R3 0x%08X\n", rr.r[2], rr.r[3]);
      WLOG("              R4 0x%08X R5 0x%08X\n", rr.r[4], rr.r[5]);
      WLOG("              R6 0x%08X R7 0x%08X\n", rr.r[6], rr.r[7]);
      if(dhcsr != 0x3000B || dfsr || cfsr || hfsr) {
          WLOG("MCU state: DHCSR 0x%X DFSR 0x%X CFSR 0x%X HFSR 0x%X\n", dhcsr, dfsr, cfsr, hfsr);
      }

  return (-1);
}


/* === Content from old source file flashloader.c === */

#define L1_WRITE_BLOCK_SIZE 0x80
#define L0_WRITE_BLOCK_SIZE 0x40

int32_t stm32l1_write_half_pages(stlink_t *sl, flash_loader_t *fl, stm32_addr_t addr, uint8_t *base, uint32_t len, uint32_t pagesize) {
  uint32_t count, off;
  uint32_t num_half_pages = len / pagesize;
  uint32_t val;
  uint32_t flash_regs_base = get_stm32l0_flash_base(sl);
  bool use_loader = true;
  int32_t ret = 0;

  // enable half page write
  stlink_read_debug32(sl, flash_regs_base + FLASH_PECR_OFF, &val);
  val |= (1 << STM32_FLASH_L1_FPRG);
  stlink_write_debug32(sl, flash_regs_base + FLASH_PECR_OFF, val);
  val |= (1 << STM32_FLASH_L1_PROG);
  stlink_write_debug32(sl, flash_regs_base + FLASH_PECR_OFF, val);

  wait_flash_busy(sl);

  for(count = 0; count < num_half_pages; count++) {
    if(use_loader) {
      ret = stlink_flash_loader_run(sl, fl, addr + count * pagesize, base + count * pagesize, pagesize);
      if(ret && count == 0) {
        /* It seems that stm32lx devices have a problem when it is blank */
        WLOG("Failed to use flash loader, fallback to soft write\n");
        use_loader = false;
      }
    }
    if(!use_loader) {
      ret = 0;
      for(off = 0; off < pagesize && !ret; off += 64) {
        uint32_t chunk = (pagesize - off > 64) ? 64 : pagesize - off;
        memcpy(sl->q_buf, base + count * pagesize + off, chunk);
        ret = stlink_write_mem32(sl, addr + count * pagesize + off, (uint16_t) chunk);
      }
    }

    if(ret) {
      WLOG("l1_stlink_flash_loader_run(%#x) failed! == -1\n", addr + count * pagesize);
      break;
    }

