STM32World/stlink/src/stlink-lib/flash_loader.c
    if(sl->verbose >= 1) {
      // show progress; writing procedure is slow and previous errors are misleading
      fprintf(stdout, "%3u/%3u halfpages written\n", count + 1, num_half_pages);
      fflush(stdout);
    }

    // wait for sr.busy to be cleared
    wait_flash_busy(sl);
  }

  // disable half page write
  stlink_read_debug32(sl, flash_regs_base + FLASH_PECR_OFF, &val);
  val &= ~((1 << STM32_FLASH_L1_FPRG) | (1 << STM32_FLASH_L1_PROG));
  stlink_write_debug32(sl, flash_regs_base + FLASH_PECR_OFF, val);
  return (ret);
}

static void set_flash_cr_pg(stlink_t *sl, uint32_t bank) {
  uint32_t cr_reg, x;

  x = read_flash_cr(sl, bank);

  if(sl->flash_type == STM32_FLASH_TYPE_C0) {
    cr_reg = STM32_FLASH_C0_CR;
    x |= (1 << FLASH_CR_PG);
  } else if(sl->flash_type == STM32_FLASH_TYPE_F2_F4) {
    cr_reg = STM32_FLASH_F4_CR;
    x |= (1 << FLASH_CR_PG);
  } else if(sl->flash_type == STM32_FLASH_TYPE_F7) {
    cr_reg = STM32_FLASH_F7_CR;
    x |= (1 << FLASH_CR_PG);
  } else if(sl->flash_type == STM32_FLASH_TYPE_L4) {
    cr_reg = STM32_FLASH_L4_CR;
    x &= ~STM32_FLASH_L4_CR_OPBITS;
    x |= (1 << STM32_FLASH_L4_CR_PG);
  } else if(sl->flash_type == STM32_FLASH_TYPE_L5_U5) {
    cr_reg = STM32_FLASH_L5_NSCR;
    x |= (1 << FLASH_CR_PG);
  } else if(sl->flash_type == STM32_FLASH_TYPE_H5) {
    cr_reg = bank == BANK_2 ? STM32_FLASH_H5_BANK2_NSCR : STM32_FLASH_H5_NSCR;
    x &= ~((1u << STM32_FLASH_H5_NSCR_SER) |
           (1u << STM32_FLASH_H5_NSCR_BER) |
           (1u << STM32_FLASH_H5_NSCR_MER));
    x |= (1u << STM32_FLASH_H5_NSCR_PG);
  } else if(sl->flash_type == STM32_FLASH_TYPE_G0 ||
             sl->flash_type == STM32_FLASH_TYPE_G4) {
    cr_reg = STM32_FLASH_Gx_CR;
    x |= (1 << FLASH_CR_PG);
  } else if(sl->flash_type == STM32_FLASH_TYPE_WB_WL) {
    cr_reg = STM32_FLASH_WB_CR;
    x |= (1 << FLASH_CR_PG);
  } else if(sl->flash_type == STM32_FLASH_TYPE_H7) {
    cr_reg = (bank == BANK_1) ? STM32_FLASH_H7_CR1 : STM32_FLASH_H7_CR2;
    x |= (1 << STM32_FLASH_H7_CR_PG);
  } else {
    cr_reg = (bank == BANK_1) ? FLASH_CR : FLASH_CR2;
    x = (1 << FLASH_CR_PG);
  }

  stlink_write_debug32(sl, cr_reg, x);
}

static void set_dma_state(stlink_t *sl, flash_loader_t *fl, int32_t bckpRstr) {
  uint32_t rcc, rcc_dma_mask, value;

  rcc = rcc_dma_mask = value = 0;

  switch (sl->flash_type) {
  case STM32_FLASH_TYPE_C0:
    rcc = STM32C0_RCC_AHBENR;
    rcc_dma_mask = STM32C0_RCC_DMAEN;
    break;
  case STM32_FLASH_TYPE_F0_F1_F3:
  case STM32_FLASH_TYPE_F1_XL:
    rcc = STM32F1_RCC_AHBENR;
    rcc_dma_mask = STM32F1_RCC_DMAEN;
    break;
  case STM32_FLASH_TYPE_F2_F4:
  case STM32_FLASH_TYPE_F7:
    rcc = STM32F4_RCC_AHB1ENR;
    rcc_dma_mask = STM32F4_RCC_DMAEN;
    break;
  case STM32_FLASH_TYPE_G0:
    rcc = STM32G0_RCC_AHBENR;
    rcc_dma_mask = STM32G0_RCC_DMAEN;
    break;
  case STM32_FLASH_TYPE_G4:
  case STM32_FLASH_TYPE_L4:
    rcc = STM32G4_RCC_AHB1ENR;
    rcc_dma_mask = STM32G4_RCC_DMAEN;
    break;
  case STM32_FLASH_TYPE_L0_L1:
    if(get_stm32l0_flash_base(sl) == STM32_FLASH_Lx_REGS_ADDR) {
      rcc = STM32L1_RCC_AHBENR;
      rcc_dma_mask = STM32L1_RCC_DMAEN;
    } else {
      rcc = STM32L0_RCC_AHBENR;
      rcc_dma_mask = STM32L0_RCC_DMAEN;
    }
    break;
  case STM32_FLASH_TYPE_L5_U5:
    rcc = STM32L5_RCC_AHB1ENR;
    rcc_dma_mask = STM32L5_RCC_DMAEN;
    break;
  case STM32_FLASH_TYPE_H7:
    rcc = STM32H7_RCC_AHB1ENR;
    rcc_dma_mask = STM32H7_RCC_DMAEN;
    break;
  case STM32_FLASH_TYPE_WB_WL:
    rcc = STM32WB_RCC_AHB1ENR;
    rcc_dma_mask = STM32WB_RCC_DMAEN;
    break;
  case STM32_FLASH_TYPE_WB0:
    rcc = STM32WB0_RCC_AHBENR;
    rcc_dma_mask = STM32WB0_RCC_AHB_DMAEN;
    break;
  default:
    return;
  }

  if(!stlink_read_debug32(sl, rcc, &value)) {
    if(bckpRstr) {
      value = (value & (~rcc_dma_mask)) | fl->rcc_dma_bkp;
    } else {
      fl->rcc_dma_bkp = value & rcc_dma_mask;
      value &= ~rcc_dma_mask;
    }
    stlink_write_debug32(sl, rcc, value);
  }
}

int32_t stlink_flashloader_start(stlink_t *sl, flash_loader_t *fl) {
  // disable DMA
  set_dma_state(sl, fl, 0);

  // wait for ongoing op to finish
  wait_flash_busy(sl);
  // Clear errors
  clear_flash_error(sl);

  if((sl->flash_type == STM32_FLASH_TYPE_F2_F4) ||
      (sl->flash_type == STM32_FLASH_TYPE_F7) ||
      (sl->flash_type == STM32_FLASH_TYPE_L4)) {
    ILOG("Starting Flash write for F2/F4/F7/L4\n");

    // Flash loader initialisation
    if(stlink_flash_loader_init(sl, fl) == -1) {
      ELOG("stlink_flash_loader_init() == -1\n");
      return (-1);
    }

    unlock_flash_if(sl); // first unlock the cr

    int32_t voltage;
    if(sl->version.stlink_v == 1) {
      WLOG("STLINK V1 cannot read voltage, use default voltage 3.2 V\n");
      voltage = 3200;
    } else {
      voltage = stlink_target_voltage(sl);
    }

    if(voltage == -1) {
      ELOG("Failed to read Target voltage\n");
      return (-1);
    }

    if(sl->flash_type == STM32_FLASH_TYPE_L4) {
      // L4 does not have a byte-write mode
      if(voltage < 1710) {
        ELOG("Target voltage (%d mV) too low for flash writes!\n", voltage);
        return (-1);
      }
    } else {
      if(voltage > 2700) {
        ILOG("enabling 32-bit flash writes\n");
        write_flash_cr_psiz(sl, 2, BANK_1);
      } else {
        ILOG("Target voltage (%d mV) too low for 32-bit flash, using 8-bit flash writes\n", voltage);
        write_flash_cr_psiz(sl, 0, BANK_1);
      }
    }

    // set programming mode
    set_flash_cr_pg(sl, BANK_1);
  } else if(sl->flash_type == STM32_FLASH_TYPE_H5) {
    ILOG("Starting Flash write for H5\n");
    unlock_flash_if(sl);
    if(stlink_flash_loader_init(sl, fl) == -1) {
      ELOG("stlink_flash_loader_init() == -1\n");
      return (-1);
    }
  } else if(sl->flash_type == STM32_FLASH_TYPE_WB_WL ||
             sl->flash_type == STM32_FLASH_TYPE_G0 ||
             sl->flash_type == STM32_FLASH_TYPE_G4 ||
             sl->flash_type == STM32_FLASH_TYPE_L5_U5 ||
             sl->flash_type == STM32_FLASH_TYPE_C0) {
    ILOG("Starting Flash write for WB/G0/G4/L5/U5/C0\n");

